ЕСКД/src/InformationRegisters/mega_ЗначенияКоэффициентовСложностиПроизводства/mega_ЗначенияКоэффициентовСложностиПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>mega_ЗначенияКоэффициентовСложностиПроизводства</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Коэффициент</name>
    <type>
      <types>CatalogRef.mega_КоэффициентыСложностиПроизводства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЕСКД/src/InformationRegisters/mega_ЗначенияКоэффициентовСложностиПроизводства/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить значения коэффициентов.
// 
// Параметры:
//  ДатаСреза - Дата - Дата среза
//  Коэффициенты - Массив Из СправочникСсылка.mega_КоэффициентыСложностиПроизводства - Коэффициенты сложности
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Выборка коэффициентов сложности
Функция ПолучитьЗначенияКоэффициентов(Знач ДатаСреза = Неопределено, Коэффициенты) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		
		ДатаСреза = ТекущаяДатаСеанса();
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	mega_ЗначенияКоэффициентовСложностиПроизводстваСрезПоследних.Коэффициент,
		|	mega_ЗначенияКоэффициентовСложностиПроизводстваСрезПоследних.Значение
		|ИЗ
		|	РегистрСведений.mega_ЗначенияКоэффициентовСложностиПроизводства.СрезПоследних(&ДатаСреза,
		|		Коэффициент В (&Коэффициенты)) КАК mega_ЗначенияКоэффициентовСложностиПроизводстваСрезПоследних";
	
	Запрос.УстановитьПараметр("Коэффициенты", Коэффициенты);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Возврат ВыборкаДетальныеЗаписи;	
КонецФункции

// Получить значение коэффициента.
// 
// Параметры:
//  ДатаСреза -Дата - Дата среза
//  Коэффициент - СправочникСсылка.mega_КоэффициентыСложностиПроизводства - Коэффициент сложности
// 
// Возвращаемое значение:
//  Число - Значение коэффициента сложности
Функция ПолучитьЗначениеКоэффициента(Знач ДатаСреза = Неопределено, Коэффициент = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Коэффициент) Тогда
		
		Возврат 1;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		
		ДатаСреза = ТекущаяДатаСеанса();
	КонецЕсли;	
		
	Коэффициенты = Новый Массив;
	Коэффициенты.Добавить(Коэффициент);
	ВыборкаДетальныеЗаписи = ПолучитьЗначенияКоэффициентов(ДатаСреза, Коэффициенты);
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЕсли;
	
	Возврат 1;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
